# Дано целое число N. Выведите следующее за ним четное число.
# Формат ввода
# Вводится целое положительное число, не превышающее 1000.

print("Введите число не привышающее 1000")
a = int(input())
print("Следующие четное число =", a // 2 * 2 + 2)
