# Вводится целое неотрицательное число N (N≤100).
# Формат вывода
# Выведите 2ᴺ.

# Тест 1
# Входные данные:
# 2
# Вывод программы:
# 4

print("Введите степерь 2-ки, которую надо вычислить:")
power = int(input())
print("2 в степени", power, 2**power)